pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/SATFM/fluidizedBed/0.orig/U.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -0.01);

boundaryField
{
    vin_DB
    {
		type                   slip;
    }

    pout
    {
		type                   slip;
    }

    w_FB
    {
        type           		   slip;
    }
}

// ************************************************************************* //
