pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/SATFM/fluidizedBed/0.orig/nut.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-8; 

boundaryField
{
    vin_DB
    {
        type               calculated;
        value              $internalField;
    }

    pout
    {
        type               calculated;
        value              $internalField;
    }

    w_FB
    {
        type               calculated;
        value              $internalField;
    }

}

// ************************************************************************* //
