pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/SATFM/fluidizedBed/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application     twoPhaseEulerTurbFoam;

startFrom       latestTime;

//startTime       0;

stopAt          endTime;

endTime         5;

deltaT          0.00001;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable on;

adjustTimeStep  yes;

maxCo           0.25;

maxDeltaT       1e-04;
minDeltaT	1e-5;

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        writeControl   writeTime;
        fields
        (
            U.particles
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            U.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            alpha.particles
            {
                 mean        on;
                 prime2Mean  on;
                 base        time;
            }
        );
    }
    probes
    {
        type            probes;
        functionObjectLibs ("libsampling.so");
        enabled         true;
        writeControl   timeStep;
        writeInterval  1;

        fields
        (

            U.particles
            alpha.particles

        );

        probeLocations
        (
            (0.0 0.0 0.25)
            (0.0 0.0 0.5)
            (0.0 0.0 0.75)
            (0.0 0.0 1.00)
            (0.0 0.015 0.25)
            (0.0 0.015 0.5)
            (0.0 0.015 0.75)
            (0.0 0.015 1.00)
            (0.07 0.0 0.25)
            (0.07 0.0 0.5)
            (0.07 0.0 0.75)
            (0.07 0.0 1.00)
 
        );

    }
}


// ************************************************************************* //
